# -*- coding: utf8 -*-
eur = """Е́вро (знак валюты — €, банковский код: EUR) — официальная валюта 19 стран «еврозоны» (Австрии, Бельгии,
Германии, Греции, Ирландии, Испании, Италии, Кипра, Латвии, Литвы, Люксембурга, Мальты, Нидерландов, Португалии, 
Словакии, Словении, Финляндии, Франции, Эстонии). Кроме того, евро используется в Черногории и Косово. Евро также 
является национальной валютой ещё 12 государств[источник не указан 308 дней], 7 из которых расположены в Европе. 
Однако в отличие от участников еврозоны, данные страны не могут влиять на денежно-кредитную политику Европейского 
центрального банка и направлять своих представителей в его руководящие органы. Таким образом, евро — это единая 
валюта для более чем 340 миллионов европейцев. На ноябрь 2013 года в наличном обращении было 951 млрд евро, что 
делало эту валюту обладателем самой высокой суммарной стоимости наличных, циркулирующих во всём мире, опережая по этому
показателю доллар США.
Евро был введён в безналичное обращение 1 января 1999 года, а 1 января 2002 года были введены в наличное обращение 
банкноты и монеты. Евро заменил в соотношении 1:1 европейскую валютную единицу (ЭКЮ), которая использовалась в 
европейской валютной системе с 1979 по 1998 год."""

cny = """До начала XX века основной денежной единицей в Китае был серебряный лян (таэль), равный 10 мао и 100 фыням. 
Для очень крупных платежей существовали также серебряные слитки-ямбы (yuanbao) весом до 50 лян. В быту, для повседневных
покупок и денежных операций использовались традиционные отлитые из бронзы круглые монеты с квадратным отверстием в 
центре — цяни, или как их называли европейцы — кэши. Широкое распространение имели банкноты и монеты различных
иностранных государств, в том числе торговые доллары США, мексиканские песо, серебряные индийские рупии[4].
Юани начали выпускаться в виде серебряных монет в 1835 году. Однако лян продолжал находиться в обращении в качестве 
денежной единицы. В лянах исчислялись таможенные пошлины (до 1930 года) и налоги (до 1933 года)."""

gbp = """Имеется несколько версий происхождения названия фунт стерлингов. Некоторые источники считают, что название 
появилось в XII веке и первоначально означало буквально «фунт чистого серебра». Это связано со «стерлингом» — древней
английской серебряной монетой. 240 монет чеканились из 1 фунта серебра (эталон «Tower pound» хранился в Королевском
монетном дворе в Тауэре, состоял из 5400 гранов, около 350 граммов). Крупные покупки выражали в «фунтах стерлингов»[2].
С другой стороны это был способ проверки полновесности монет — если масса 240 монет не равна 1 фунту, монеты могли быть
фальшивыми или слишком изношенными.
В 1955 году Оксфордский словарь английского языка предложил версию, согласно которой название стерлинг датируется 
примерно 1300 годом и происходит от бытового названия серебряного норманнского пенни, на котором имелись маленькие 
звёздочки (на староанглийском: steorling)."""

chf = """Швейцарский франк был впервые введён в качестве денежной единицы Гельветической республики в 1798 году, однако 
уже в 1803 году в связи с её ликвидацией выпуск был прекращён.
Современный швейцарский франк был введён в денежное обращение в 1850 году и по номинальной стоимости был равен
французскому франку. Он заменил находившиеся тогда в хождении разнообразные валюты швейцарских кантонов, несколько из 
которых к тому времени использовали франк (делившийся на 10 батценов или 100 сантимов), который по стоимости был равен
1,5 французского франка.
До 1850 года изготовлением монет в Швейцарии занималось более 75 различных учреждений, включая 25 кантонов и 
полукантонов, 16 городов, а также аббатства. В обращении находилось около 860 видов различных монет, различной ценности
и номинала. Более того, в 1850 году национальные валюты составляли лишь 15 % от общего числа денег в обращении, а 
оставшуюся часть составляли иностранные валюты, в основном привезённые купцами. Помимо этого, некоторые частные банки
стали выпускать первые банкноты, так что общее количество находившихся в обращении монет и банкнот составляло около 
8000. Это делало валютную систему чрезвычайно сложной."""

usd = """До́ллар Соединённых Шта́тов Аме́рики (англ. United States dollar, МФА: [jʊˌnaɪ.tɪd ˈsteɪts ˈdɑlɚ]) — денежная 
единица США, одна из основных резервных валют мира. 1 доллар = 100 центов. Символьное обозначение в англоязычных 
текстах: $. Буквенный код валюты: USD. Правом денежной эмиссии обладает Федеральная резервная система (англ. Federal 
Reserve System), выполняющая в США функции центрального банка.
Доллар США также имеет статус национальной валюты в некоторых других странах (например, Маршалловы острова, Сальвадор).
Именно доллар США часто является дополнительной (параллельной) валютой в тех странах, где национальная валюта не 
является единственным законным средством платежа, включая случаи, когда собственная валюта фактически не используется
в наличном и/или безналичном обращении (как, например, в Зимбабве[2])."""
